<?php

namespace App\Services;

use App\Models\User;
use Illuminate\Support\Str;
use App\Services\Sms\SmsService;
use App\Exceptions\Auth\ExpiredOtpException;
use App\Exceptions\Auth\InvalidLoginTokenException;
use App\Exceptions\Auth\InvalidOtpException;
use App\Exceptions\Auth\OtpAlreadyUsedException;
use App\Exceptions\Auth\OtpAttemptsExceededException;
use App\Repositories\Interfaces\OtpCodeRepositoryInterface;

class OtpService
{
    /**
     * Repository مربوط به OTP
     */
    protected OtpCodeRepositoryInterface $otpRepository;

    /**
     * سرویس ارسال پیامک
     */
    protected SmsService $smsService;

    public function __construct(
        OtpCodeRepositoryInterface $otpRepository,
        SmsService $smsService
    ) {
        $this->otpRepository = $otpRepository;

        $this->smsService = $smsService;
    }

    /**
     * تولید کد OTP
     */
    protected function generateOtp(): string
    {
        return (string) random_int(
            100000,
            999999
        );
    }

    /**
     * تولید Login Token
     */
    protected function generateLoginToken(): string
    {
        return Str::random(64);
    }

    /**
     * ارسال کد تایید
     */
    public function sendOtp(
        string $mobile,
        string $purpose = 'login'
    ): string {

        /*
        |--------------------------------------------------------------------------
        | غیرفعال کردن تمام OTP های فعال قبلی
        |--------------------------------------------------------------------------
        */

        $this->otpRepository
            ->deactivateActiveOtps(
                $mobile,
                $purpose
            );

        /*
        |--------------------------------------------------------------------------
        | تولید OTP جدید
        |--------------------------------------------------------------------------
        */

        $otp = $this->generateOtp();

        /*
        |--------------------------------------------------------------------------
        | تولید Login Token
        |--------------------------------------------------------------------------
        */

        $loginToken = $this->generateLoginToken();

        /*
        |--------------------------------------------------------------------------
        | ذخیره در دیتابیس
        |--------------------------------------------------------------------------
        */

        $this->otpRepository->create([

            'mobile' => $mobile,

            'code' => $otp,

            'login_token' => $loginToken,

            'purpose' => $purpose,

            'attempts' => 0,

            'is_verified' => false,

            'expires_at' => now()->addMinutes(2),

            'ip_address' => request()->ip(),

            'user_agent' => request()->userAgent(),

        ]);

        /*
        |--------------------------------------------------------------------------
        | ارسال پیامک
        |--------------------------------------------------------------------------
        */

        $this->smsService->sendOtp(

            $mobile,

            $otp

        );

        /*
        |--------------------------------------------------------------------------
        | بازگرداندن Login Token
        |--------------------------------------------------------------------------
        */

        return $loginToken;
    }

    /**
     * تایید کد OTP
     */
    public function verifyOtp(
        string $loginToken,
        string $code
    ): User {

        /*
            |--------------------------------------------------------------------------
            | دریافت OTP
            |--------------------------------------------------------------------------
            */

        $otp = $this->otpRepository
            ->findByLoginToken(
                $loginToken
            );

        /*
            |--------------------------------------------------------------------------
            | بررسی معتبر بودن Login Token
            |--------------------------------------------------------------------------
            */

        if (!$otp) {

            throw new InvalidLoginTokenException();
        }

        /*
            |--------------------------------------------------------------------------
            | بروزرسانی اطلاعات
            |--------------------------------------------------------------------------
            */

        $otp->refresh();

        /*
            |--------------------------------------------------------------------------
            | بررسی تعداد تلاش
            |--------------------------------------------------------------------------
            */

        if ($otp->attempts >= 5) {

            throw new OtpAttemptsExceededException();
        }

        /*
            |--------------------------------------------------------------------------
            | بررسی انقضا
            |--------------------------------------------------------------------------
            */

        if ($otp->isExpired()) {

            throw new ExpiredOtpException();
        }

        /*
            |--------------------------------------------------------------------------
            | بررسی استفاده شدن
            |--------------------------------------------------------------------------
            */

        if ($otp->isUsed()) {

            throw new OtpAlreadyUsedException();
        }

        /*
            |--------------------------------------------------------------------------
            | بررسی صحت کد
            |--------------------------------------------------------------------------
            */

        if ($otp->code !== $code) {

            $otp->incrementAttempts();

            throw new InvalidOtpException();
        }

        /*
            |--------------------------------------------------------------------------
            | ایجاد یا دریافت کاربر
            |--------------------------------------------------------------------------
            */

        $user = User::firstOrCreate(

            [

                'mobile' => $otp->mobile,

            ],

            [

                'phone_verified_at' => now(),

            ]

        );

        /*
            |--------------------------------------------------------------------------
            | ثبت اطلاعات ورود
            |--------------------------------------------------------------------------
            */

        $user->update([

            'phone_verified_at' => now(),

            'last_login_at' => now(),

        ]);

        /*
            |--------------------------------------------------------------------------
            | ثبت اطلاعات OTP
            |--------------------------------------------------------------------------
            */

        $otp->markAsVerified();

        $otp->user_id = $user->id;

        $otp->attempts = 0;

        $otp->save();

        /*
            |--------------------------------------------------------------------------
            | بازگرداندن کاربر
            |--------------------------------------------------------------------------
            */

        return $user;
    }

    /**
     * ارسال مجدد کد تایید
     */
    public function resendOtp(
        string $loginToken
    ): array {

        /*
            |--------------------------------------------------------------------------
            | دریافت OTP قبلی
            |--------------------------------------------------------------------------
            */

        $otp = $this->otpRepository
            ->findByLoginToken(
                $loginToken
            );

        /*
            |--------------------------------------------------------------------------
            | بررسی معتبر بودن Login Token
            |--------------------------------------------------------------------------
            */

        if (!$otp) {

            throw new InvalidLoginTokenException();
        }

        /*
            |--------------------------------------------------------------------------
            | بررسی استفاده شدن
            |--------------------------------------------------------------------------
            */

        if ($otp->isUsed()) {

            throw new OtpAlreadyUsedException();
        }

        /*
            |--------------------------------------------------------------------------
            | غیرفعال کردن OTP قبلی
            |--------------------------------------------------------------------------
            */

        $otp->markAsUsed();

        /*
            |--------------------------------------------------------------------------
            | تولید OTP جدید
            |--------------------------------------------------------------------------
            */

        $newOtp = $this->generateOtp();

        /*
            |--------------------------------------------------------------------------
            | تولید Login Token جدید
            |--------------------------------------------------------------------------
            */

        $newLoginToken = $this->generateLoginToken();

        /*
            |--------------------------------------------------------------------------
            | ذخیره OTP جدید
            |--------------------------------------------------------------------------
            */

        $this->otpRepository->create([

            'user_id' => $otp->user_id,

            'mobile' => $otp->mobile,

            'code' => $newOtp,

            'login_token' => $newLoginToken,

            'purpose' => $otp->purpose,

            'attempts' => 0,

            'is_verified' => false,

            'expires_at' => now()->addMinutes(2),

            'ip_address' => request()->ip(),

            'user_agent' => request()->userAgent(),

        ]);

        /*
            |--------------------------------------------------------------------------
            | ارسال پیامک
            |--------------------------------------------------------------------------
            */

        $this->smsService->sendOtp(

            $otp->mobile,

            $newOtp

        );

        /*
            |--------------------------------------------------------------------------
            | بازگرداندن نتیجه
            |--------------------------------------------------------------------------
            */

        return [

            'login_token' => $newLoginToken,

            'message' => 'کد تایید مجدداً ارسال شد.',

        ];
    }
}
